app/controllers/author_controller.rb

  def create
    response = Typhoeus.get("https://api.instagram.com/v1/users/self/?access_token=9861387.79be83d.e6f6b8f3923c4fa9949490f467c2eee2")
    result = JSON.parse(response.body)
    @author = Author.new
    @author.user_id = result.dig('data', 'id')
    @author.user_name = result.dig('data', 'username')
    @author.profile_picture = result.dig('data', 'profile_picture')
    @author.bio = result.dig('data', 'bio')
    if @author.save
---
INSERT INTO `authors` (`user_name`, `profile_picture`, `bio`, `created_at`, `updated_at`) VALUES ('stellasquido', 'https://scontent.cdninstagram.com/vp/0e9a68b0265a5c33dffdd6a23d66e507/5C0DC585/t51.2885-19/s150x150/12940196_1110652445639458_1718063923_a.jpg', 'Happy wife. Dog mom. Techie. All for the outdoors. Can be bribed with pancakes, waffles, red wine and ystervarkies...or a plane ticket somewhere!', '2018-07-24 19:03:03', '2018-07-24 19:03:03')