app/controllers/entries_controller.rb

  def index
    response = Typhoeus.get("https://api.instagram.com/v1/users/self/media/recent/?access_token=9861387.79be83d.e6f6b8f3923c4fa9949490f467c2eee2")
    result = JSON.parse(response.body)
    first_entry = result['data'][0]
    puts '----------------------------------------------------'
    puts first_entry['images']['standard_resolution']['url']
    puts first_entry['caption']['text']
    puts first_entry['location']
    puts first_entry['created_time']
    puts '----------------------------------------------------'
    @entry = Entry.new
    @entry.caption = first_entry['caption']['text'] if first_entry['caption']['text']
    @entry.time_posted = first_entry['created_time']
    @entry.image_url = first_entry['images']['standard_resolution']['url']
    @entry.location = first_entry['location'] if first_entry['location']
    @entry.author_id = @author.id
    if @entry.save
---
INSERT INTO `entries` (`caption`, `time_posted`, `image_url`, `author_id`, `created_at`, `updated_at`) VALUES ('Completely present in this moment (not a state I’m fortunate to achieve often). Balmy prom sunsets are bliss. My soul is at peace. #nofilter #nofilterneeded #sunset #seapoint #seapointpromenade #capetown #southafrica #balmy #balmynights #peace #present #mindful #inthemoment #beinghuman #bliss #state', 1531943877, 'https://scontent.cdninstagram.com/vp/e4ab45b8e6643703fa971180c616cd67/5BDA45BF/t51.2885-15/sh0.08/e35/s640x640/36806387_249427889119659_3891969986335342592_n.jpg', 11, '2018-07-24 20:16:33', '2018-07-24 20:16:33')

  def set_author
    @author = Author.find_by(id: 11)
---
SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 11 LIMIT 1